app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

  def show
    @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @micropost = current_user.microposts.build(params[:micropost])

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "First micropost!"], ["created_at", Mon, 09 Sep 2013 15:01:16 UTC +00:00], ["updated_at", Mon, 09 Sep 2013 15:01:16 UTC +00:00], ["user_id", 1]]

  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "295"]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 295]]