app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:relationship][:followed_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]

  def destroy
    @user = Relationship.find(params[:id]).followed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "1"]]