app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 09 Sep 2013 14:34:31 UTC +00:00], ["email", "kutashov.alexandr@yandex.ru"], ["name", "Alexandr Kutashov"], ["updated_at", Mon, 09 Sep 2013 14:34:31 UTC +00:00]]

  def update
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "5"]]

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]